# pyCHNOSZ demo

Demo of functions available in pyCHNOSZ version 0.0.5 (Jan 22, 2021)

In [1]:
from pyCHNOSZ import add_OBIGT, reset, info, subcrt

### info

In [2]:
info("Fe+2")

[526]

In [3]:
info(526)

,name,abbrv,formula,state,ref1,ref2,date,E_units,G,H,...,Cp,V,a1,a2,a3,a4,c1,c2,omega,Z
526,Fe+2,Fe+2,Fe+2,aq,SSWS97,N,1997-11-13,cal,-21870.0,-22050.0,...,-7.9,-22.2,-0.07867,-969.69,9.5479,-23780.0,14.786,-46437.0,143820.0,2.0

In [4]:
info(info(["HCO3-", "CH4"], state=["aq", "gas"]))

info.numeric: Cp of methane(gas) is NA; set by EOS parameters to 8.54 cal K-1 mol-1

,name,abbrv,formula,state,ref1,ref2,date,E_units,G,H,...,Cp,V,a1.a,a2.b,a3.c,a4.d,c1.e,c2.f,omega.lambda,z.T
13,HCO3-,HCO3-,HCO3-,aq,SH88,NA,1997-11-06,cal,-140282.0,-164898.0,...,-8.460000,24.6,0.75621,115.05000,1.2346,-28266.0,12.9395,-47579.0,127330.0,-1.0
2603,methane,CH4,CH4,gas,WEP+82,Kel60,1987-12-15,cal,-12122.4,-17880.0,...,8.543362,0.0,5.65000,0.01144,-46000.0000,0.0,0.0000,0.0,0.0,1500.0

### add_OBIGT and reset

In [5]:
info(info(["K-feldspar", "kaolinite"]))

,name,abbrv,formula,state,ref1,ref2,date,E_units,G,H,...,Cp,V,a,b,c,d,e,f,lambda,T
2557,K-feldspar,Kfs,KAlSi3O8,cr,Ber88,SHD91,2017-10-03,cal,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2543,kaolinite,Kln,Al2Si2O9H4,cr,Ber88,NA,2017-10-01,cal,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
_ = add_OBIGT("SUPCRT92")

add.OBIGT: read 178 rows; made 65 replacements, 113 additions [energy units: cal]

In [7]:
info(info(["K-feldspar", "kaolinite"]))

info.numeric: Cp of K-feldspar(cr) is NA; set by EOS parameters to 44.22 cal K-1 mol-1

info.numeric: Cp of kaolinite(cr) is NA; set by EOS parameters to 57.27 cal K-1 mol-1

,name,abbrv,formula,state,ref1,ref2,date,E_units,G,H,...,Cp,V,a,b,c,d,e,f,lambda,T
2557,K-feldspar,K-Fs,K(AlSi3)O8,cr,HDNB78,N,1978-05-05,cal,-895374.0,-949188.0,...,44.215918,108.87,76.617,0.004311,-2994500.0,0.0,0.0,0.0,0.0,1400.0
2543,kaolinite,Kln,Al2Si2O5(OH)4,cr,HDNB78,N,1978-05-05,cal,-905614.0,-982221.0,...,57.267215,99.52,72.770,0.029200,-2152000.0,0.0,0.0,0.0,0.0,1000.0

In [8]:
reset()

reset: resetting "thermo" object

OBIGT: loading default database with 1880 aqueous, 3418 total species

### subcrt

In [9]:
output = subcrt([13, 24])

subcrt: 2 species at 15 values of T (ºC) and P (bar) (wet) [energy units: cal]

In [10]:
output["species"]

     name formula state  ispecies
13  HCO3-   HCO3-    aq      13.0
24  SO4-2   SO4-2    aq      24.0

In [11]:
output["out"]["HCO3-"].head()

,T,P,rho,logK,G,H,S,V,Cp
1,0.01,1.00000,0.999829,111.754350,-139681.473815,-164549.882789,24.758605,21.179738,-23.269536
2,25.00,1.00000,0.997061,102.827640,-140282.000000,-164898.000000,23.530000,24.210873,-8.329074
3,50.00,1.00000,0.988030,95.265656,-140863.278012,-165055.703179,23.020406,25.204970,-5.163872
4,75.00,1.00000,0.974864,88.783080,-141434.015984,-165183.296646,22.640209,25.265864,-5.399977
5,100.00,1.01322,0.958393,83.163313,-141994.817523,-165339.818722,22.206802,24.657922,-7.369166

In [12]:
output["out"]["SO4-2"].head()

,T,P,rho,logK,G,H,S,V,Cp
1,0.01,1.00000,0.999829,142.200245,-177735.718840,-215289.445479,11.926887,7.811069,-118.435160
2,25.00,1.00000,0.997061,130.423875,-177930.000000,-217400.000000,4.500000,12.917649,-63.597213
3,50.00,1.00000,0.988030,120.370218,-177983.800105,-218781.778157,0.042386,14.242434,-49.986868
4,75.00,1.00000,0.974864,111.698475,-177938.904196,-219991.866485,-3.565381,13.732272,-47.998648
5,100.00,1.01322,0.958393,104.137734,-177806.992390,-221226.267533,-6.988075,11.798014,-51.485603

In [13]:
output = subcrt(species=["H2", "O2", "H2O"],
                coeff = [-1.0, -0.5, 1.0],
                state = ["aq", "gas", "liq"],
                T=[30, 50], P=1000)

subcrt: 3 species at 2 values of T (ºC) and P (bar) (wet) [energy units: cal]

In [14]:
output["reaction"]

      coeff    name formula state  ispecies
62     -1.0      H2      H2    aq      62.0
2612   -0.5  oxygen      O2   gas    2612.0
1       1.0   water     H2O   liq       1.0

In [15]:
output["out"]

,T,P,rho,logK,G,H,S,V,Cp
1,30.0,1000,1.035962,43.972483,-60995.224481,-67334.946053,-21.070030,-7.663664,-24.488829
2,50.0,1000,1.027403,40.952949,-60554.525428,-67908.486770,-22.904593,-8.086124,-21.219328

### proteins

In [16]:
info("LYSC_CHICK")
output = subcrt("LYSC_CHICK", T=[25, 50, 75, 100])

protein.OBIGT: found
LYSC_CHICK (C613H959N193O185S10,
129 residues)

subcrt: 1 species at 4 values of T (ºC) and P (bar) (wet) [energy units: cal]

In [17]:
output["out"]["LYSC_CHICK"]

,T,P,rho,logK,G,H,S,V,Cp
1,25.0,1.00000,0.997061,3250.232004,-4.434110e+06,-1.057328e+07,4337.860000,10420.950081,6415.518468
2,50.0,1.00000,0.988030,3076.734742,-4.549372e+06,-1.040345e+07,4884.505798,10600.231211,7073.981185
3,75.0,1.00000,0.974864,2936.711074,-4.678266e+06,-1.022241e+07,5423.991680,10708.145189,7376.581257
4,100.0,1.01322,0.958393,2823.196483,-4.820386e+06,-1.003568e+07,5941.891731,10782.933049,7548.444290